app/controllers/pages_controller.rb

  def statistic
      Visitors.all.each do |visitor|
---
SELECT "visitors".* FROM "visitors"  WHERE (remote_ip IN ('127.0.0.1'))